def num2words(n):
    a = ['','один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять','одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    b = ['','','двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    c = ['','сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот']
   
    if n == 0:
        return 'ноль рублей'
    
    result = ''
    
    if n // 1000 > 0:
        result += c[n // 1000] + ' тысяч '
        n %= 1000
    
    if n // 100 > 0:
        result += c[n // 100] + ' '
        n %= 100
    
    if n > 0:
        if n < 20:
            result += a[n] + ' '
        else:
            result += b[n // 10] + ' ' + a[n % 10] + ' '
    
    rub_ends = ['рубль', 'рубля', 'рублей']
    if n % 10 == 1 and n % 100 != 11:
        result += rub_ends[0]
    elif 2 <= n % 10 <= 4 and (n % 100 < 10 or n % 100 >= 20):
        result += rub_ends[1]
    else:
        result += rub_ends[2]
    
    return result

summa = int(input('Введите сумму от 1 до 100000: '))
if summa < 1 or summa > 100000:
    print('Неверный ввод')
else:
    print(num2words(summa))